#include <iostream>

using namespace std;

void module_9()
{
	setlocale(LC_CTYPE, "Ru");

	int choice;

	do {
		cout << "1 - понедельник." << endl;
		cout << "2 - вторник." << endl;
		cout << "3 - среда." << endl;
		cout << "4 - четверг." << endl;
		cout << "5 - пятница." << endl;
		cout << "6 - суббота." << endl;
		cout << "7 - Выход." << endl;
		cout << endl;

		cout << "Введите день недели: ";
		cin >> choice;
		cout << endl;

		switch (choice)
		{
		case 1: {
			cout << "----------------------------------------Понедельник----------------------------------------" << endl;
			cout << " 14.40-16.00 пусто\n 16.20-17.50 Физ-ра\n 18.05-19.25 лк.341-4 Компьютерные языки разметки\n 19.40-21.00 пусто" << endl;
			cout << "-------------------------------------------------------------------------------------------" << endl;
			break;
		}
		case 2: {
			cout << "------------------------------------------Вторник------------------------------------------" << endl;
			cout << " 14.40-16.00 пусто\n 16.20-17.50 пусто\n 18.05-19.25 лк.200-3а Основы программной инженерии\n 19.40-21.00 I лк.100-3а Великая Отечественная война советского народа\n II пз.423-4 Белорусский язык" << endl;
			cout << "-------------------------------------------------------------------------------------------" << endl;
			break;
		}
		case 3: {
			cout << "-------------------------------------------Среда-------------------------------------------" << endl;
			cout << " 14.40-16.00 лб.309-1 Основы программной инженерии\n 16.20-17.50 лб.209-1 Компьютерные языки разметки\n 18.05-19.25 лк.408-2 Линейная алгебра и аналитическая геометрия\n 19.40-21.00 пз.222-общ.2 Английский язык" << endl;
			cout << "-------------------------------------------------------------------------------------------" << endl;
			break;
		}
		case 4: {
			cout << "------------------------------------------Четверг------------------------------------------" << endl;
			cout << " 14.40-16.00 лк.200-3а Основы алгоритмизации и программирования\n 16.20-17.50 Физ-ра\n 18.05-19.25 I пз.308а-4 Математический анализ\n II лк.200-3а Математический анализ\n 19.40-21.00 пусто" << endl;
			cout << "-------------------------------------------------------------------------------------------" << endl;
			break;
		}
		case 5: {
			cout << "------------------------------------------Пятница------------------------------------------" << endl;
			cout << " 14.40-16.00 лк.200-3а Арифметико-логические основы вычислительных систем\n 16.20-17.50 I пз.423-4 Белорусский язык\n пз.334-4 Арифметико-логические основы вычислительных систем\n 18.05-19.25 пз.312-4 Линейная алгебра\n 19.40-21.00 лб.324-1 Основы алгоритмизации и программирования" << endl;
			cout << "-------------------------------------------------------------------------------------------" << endl;
			break;
		}
		case 6: {
			cout << "------------------------------------------Суббота------------------------------------------" << endl;
			cout << " 13.00-14.20 пз.335-4 Математический анализ\n 14.40-16.00 лк.408-2 Математический анализ\n 16.30 - 17.50  пз. Английский язык" << endl;
			cout << "-------------------------------------------------------------------------------------------" << endl;
			break;
		}
		case 7: break;
		}
	}
		while (choice != 7);
	
}
